Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/lcd/esp_lcd_panel_dsi.c
/*
 * SPDX-FileCopyrightText: 2021-2024 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stdlib.h>
#include <stdarg.h>
#include <sys/cdefs.h>
#include <sys/param.h>
#include <string.h>
#include "sdkconfig.h"
#if CONFIG_LCD_DSI_ENABLE_DEBUG_LOG
// The local log level must be defined before including esp_log.h
// Set the maximum log level for this source file
#define LOG_LOCAL_LEVEL ESP_LOG_DEBUG
#endif
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_attr.h"
#include "esp_check.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_interface.h"
#include "esp_intr_alloc.h"
#include "esp_psram.h"
#include "esp_cache.h"
#include "soc/soc_caps.h"
#include "rom/cache.h"

#include "hp_sys_clkrst_reg.h"
#include "mipi_dsi_host_struct.h"
#include "mipi_dsi.h"
#include "bsp_lcd.h"
#include "dw_gdma.h"

#include "esp_lcd_panel_dsi.h"

#define DSI_LCD_PANEL_MAX_FB_NUM         3 // maximum supported frame buffer number

#define DSI_PANEL_SWAP_XY  0
#define DSI_PANEL_MIRROR_Y 1
#define DSI_PANEL_MIRROR_X 2

typedef enum {
    ROTATE_MASK_SWAP_XY = BIT(DSI_PANEL_SWAP_XY),
    ROTATE_MASK_MIRROR_Y = BIT(DSI_PANEL_MIRROR_Y),
    ROTATE_MASK_MIRROR_X = BIT(DSI_PANEL_MIRROR_X),
} panel_rotate_mask_t;

static const char *TAG = "lcd_panel.dsi";

typedef struct esp_dsi_panel_t esp_dsi_panel_t;

static esp_err_t dsi_panel_del(esp_lcd_panel_t *panel);
static esp_err_t dsi_panel_reset(esp_lcd_panel_t *panel);
static esp_err_t dsi_panel_init(esp_lcd_panel_t *panel);
static esp_err_t dsi_panel_draw_bitmap(esp_lcd_panel_t *panel, int x_start, int y_start, int x_end, int y_end, const void *color_data);
static esp_err_t dsi_panel_invert_color(esp_lcd_panel_t *panel, bool invert_color_data);
static esp_err_t dsi_panel_mirror(esp_lcd_panel_t *panel, bool mirror_x, bool mirror_y);
static esp_err_t dsi_panel_swap_xy(esp_lcd_panel_t *panel, bool swap_axes);
static esp_err_t dsi_panel_set_gap(esp_lcd_panel_t *panel, int x_gap, int y_gap);
static esp_err_t dsi_panel_disp_on_off(esp_lcd_panel_t *panel, bool off);

static void lcd_default_isr_handler(void *args);

struct esp_dsi_panel_t {
    esp_lcd_panel_t base;  // Base class of generic lcd panel
    size_t num_fbs;           // Number of frame buffers
    size_t fb_bits_per_pixel; // Frame buffer color depth, in bpp
    size_t sram_trans_align;      /*!< Alignment of buffers (frame buffer or bounce buffer) that allocated in SRAM */
    size_t psram_trans_align;     /*!< Alignment of buffers (frame buffer) that allocated in PSRAM */
    esp_lcd_dsi_timing_t timings;   // RGB timing parameters (e.g. pclk, sync pulse, porch width)
    uint8_t *fbs[DSI_LCD_PANEL_MAX_FB_NUM]; // Frame buffers
    uint8_t cur_fb_index;  // Current frame buffer index
    size_t fb_size;        // Size of frame buffer
    // esp_lcd_dsi_timing_t timings;   // DSI timing parameters (e.g. pclk, sync pulse, porch width)
    esp_lcd_dsi_panel_vsync_cb_t on_vsync; // VSYNC event callback
    void *user_ctx;                 // Reserved user's data of callback functions
    int x_gap;                      // Extra gap in x coordinate, it's used when calculate the flush window
    int y_gap;                      // Extra gap in y coordinate, it's used when calculate the flush window
    int rotate_mask;                // panel rotate_mask mask, Or'ed of `panel_rotate_mask_t`
    struct {
        //     uint32_t disp_en_level: 1;       // The level which can turn on the screen by `disp_gpio_num`
        //     uint32_t stream_mode: 1;         // If set, the LCD transfers data continuously, otherwise, it stops refreshing the LCD when transaction done
        uint32_t fb_in_psram: 1;         // Whether the frame buffer is in PSRAM
        //     uint32_t need_update_pclk: 1;    // Whether to update the PCLK before start a new transaction
        //     uint32_t need_restart: 1;        // Whether to restart the LCD controller and the DMA
        //     uint32_t bb_invalidate_cache: 1; // Whether to do cache invalidation in bounce buffer mode
    } flags;
};

static esp_err_t lcd_dsi_panel_alloc_frame_buffers(const esp_lcd_dsi_panel_config_t *dsi_panel_config, esp_dsi_panel_t *dsi_panel)
{
    bool fb_in_psram = false;
    size_t psram_trans_align = dsi_panel_config->psram_trans_align ? dsi_panel_config->psram_trans_align : 64;
    size_t sram_trans_align = dsi_panel_config->sram_trans_align ? dsi_panel_config->sram_trans_align : 4;
    dsi_panel->psram_trans_align = psram_trans_align;
    dsi_panel->sram_trans_align = sram_trans_align;

    // alloc frame buffer
    if (dsi_panel->num_fbs > 0) {
        // fb_in_psram is only an option, if there's no PSRAM on board, we fallback to alloc from SRAM
        if (dsi_panel_config->flags.fb_in_psram) {
#if CONFIG_SPIRAM_USE_MALLOC || CONFIG_SPIRAM_USE_CAPS_ALLOC
            if (esp_psram_is_initialized()) {
                fb_in_psram = true;
            }
#endif
        }
        for (int i = 0; i < dsi_panel->num_fbs; i++) {
            if (fb_in_psram) {
                // the low level malloc function will help check the validation of alignment
                dsi_panel->fbs[i] = heap_caps_aligned_calloc(psram_trans_align, 1, dsi_panel->fb_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
            } else {
                dsi_panel->fbs[i] = heap_caps_aligned_calloc(sram_trans_align, 1, dsi_panel->fb_size, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
            }
            ESP_RETURN_ON_FALSE(dsi_panel->fbs[i], ESP_ERR_NO_MEM, TAG, "no mem for frame buffer");
        }
    }

    dsi_panel->cur_fb_index = 0;
    dsi_panel->flags.fb_in_psram = fb_in_psram;

    return ESP_OK;
}

static esp_err_t lcd_dsi_panel_destory(esp_dsi_panel_t *dsi_panel)
{
    for (size_t i = 0; i < dsi_panel->num_fbs; i++) {
        if (dsi_panel->fbs[i]) {
            free(dsi_panel->fbs[i]);
        }
    }
    free(dsi_panel);
    return ESP_OK;
}

esp_err_t esp_lcd_new_dsi_panel(const esp_lcd_dsi_panel_config_t *dsi_panel_config, esp_lcd_panel_handle_t *ret_panel)
{
#if CONFIG_LCD_DSI_ENABLE_DEBUG_LOG
    esp_log_level_set(TAG, ESP_LOG_DEBUG);
#endif
    esp_err_t ret = ESP_OK;
    esp_dsi_panel_t *dsi_panel = NULL;
    ESP_RETURN_ON_FALSE(dsi_panel_config && ret_panel, ESP_ERR_INVALID_ARG, TAG, "invalid parameter");
    ESP_RETURN_ON_FALSE(dsi_panel_config->num_fbs <= DSI_LCD_PANEL_MAX_FB_NUM, ESP_ERR_INVALID_ARG, TAG, "too many frame buffers");

    size_t fb_bits_per_pixel = dsi_panel_config->bits_per_pixel;
    // calculate buffer size
    size_t fb_size = dsi_panel_config->timings.h_res * dsi_panel_config->timings.v_res * fb_bits_per_pixel / 8;

    // DMA descriptors must be placed in internal SRAM (requested by DMA)
    dsi_panel = heap_caps_calloc(1, sizeof(esp_dsi_panel_t), MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
    ESP_GOTO_ON_FALSE(dsi_panel, ESP_ERR_NO_MEM, err, TAG, "no mem for dsi panel");
    dsi_panel->num_fbs = dsi_panel_config->num_fbs;
    dsi_panel->fb_size = fb_size;

    // allocate frame buffers + bounce buffers
    ESP_GOTO_ON_ERROR(lcd_dsi_panel_alloc_frame_buffers(dsi_panel_config, dsi_panel), err, TAG, "alloc frame buffers failed");

    mipi_dsi_timing_t dsi_timing = {
        .dpi_hsa = dsi_panel_config->timings.hsync_sync_active,
        .dpi_hbp = dsi_panel_config->timings.hsync_back_porch,
        .dpi_hfp = dsi_panel_config->timings.hsync_front_porch,
        .dpi_hact = dsi_panel_config->timings.h_res,
        .dpi_vsa = dsi_panel_config->timings.vsync_sync_active,
        .dpi_vbp = dsi_panel_config->timings.vsync_back_porch,
        .dpi_vfp = dsi_panel_config->timings.vsync_front_porch,
        .dpi_vact = dsi_panel_config->timings.v_res,
        .dpi_clock_rate = dsi_panel_config->timings.dpi_clk_hz,
        .dsi_line_rate = dsi_panel_config->timings.dsi_line_hz,
        .dsi_line_num = dsi_panel_config->timings.dsi_line_num,
    };
    mipi_dsi_set_timing(&dsi_timing);
    mipi_dsi_clock_init();
    mipi_dsi_host_phy_init();

    REG_CLR_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_DMA2D_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_DMA2D);
    REG_CLR_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_DMA2D);

    REG_CLR_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_SOC_CLK_CTRL1_REG, HP_SYS_CLKRST_REG_PPA_SYS_CLK_EN);
    REG_SET_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_PPA);
    REG_CLR_BIT(HP_SYS_CLKRST_HP_RST_EN0_REG, HP_SYS_CLKRST_REG_RST_EN_PPA);

    ESP_RETURN_ON_ERROR(dw_gdma_mipi_dsi_init(dsi_panel->fbs[0], dsi_panel->fb_size, dsi_panel->psram_trans_align), TAG,
                        "Initialize GDMA for MIPI DSI failed");

    mipi_dsi_bridge_init();

    mipi_dsih_hal_gen_cmd_mode_en(1);

