Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/lcd/esp_lcd_panel_dsi.c
#if !TEST_DSI_LOOPBACK
    MIPI_DSI_HOST.lpclk_ctrl.val = 0x00000000 |
                                   ((0 & 0x00000001) << 1) | // bit[    1] AUTO_CLKLANE_CTRL     = 0 (Automatic mechanism to stop providing clock in the clock lane when time allows.
                                   ((0 & 0x00000001) << 0);  // bit[    0] TXREQUESTCLKHS        = 1 (Requesting High Speed Clock Transmission.
    // MIPI_DSI_HOST.phy_ulps_ctrl.phy_txrequlpsclk = 1;
#endif

    dsi_panel->timings = dsi_panel_config->timings;
    dsi_panel->fb_bits_per_pixel = fb_bits_per_pixel;
    // fill function table
    dsi_panel->base.del = dsi_panel_del;
    dsi_panel->base.reset = dsi_panel_reset;
    dsi_panel->base.init = dsi_panel_init;
    dsi_panel->base.draw_bitmap = dsi_panel_draw_bitmap;
    dsi_panel->base.disp_on_off = dsi_panel_disp_on_off;
    dsi_panel->base.invert_color = dsi_panel_invert_color;
    dsi_panel->base.mirror = dsi_panel_mirror;
    dsi_panel->base.swap_xy = dsi_panel_swap_xy;
    dsi_panel->base.set_gap = dsi_panel_set_gap;
    // return base class
    *ret_panel = &(dsi_panel->base);

    ESP_LOGI(TAG, "new dsi panel @%p, num_fbs=%zu, fb_size=%zu", dsi_panel, dsi_panel->num_fbs, dsi_panel->fb_size);
    for (size_t i = 0; i < dsi_panel->num_fbs; i++) {
        ESP_LOGI(TAG, "fb[%zu] @%p", i, dsi_panel->fbs[i]);
    }
    return ESP_OK;

err:
    if (dsi_panel) {
        lcd_dsi_panel_destory(dsi_panel);
    }
    return ret;
}

esp_err_t esp_lcd_dsi_panel_register_event_callbacks(esp_lcd_panel_handle_t panel, const esp_lcd_dsi_panel_event_callbacks_t *callbacks, void *user_ctx)
{
    ESP_RETURN_ON_FALSE(panel && callbacks, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
#if CONFIG_LCD_DSI_ISR_IRAM_SAFE
    if (callbacks->on_vsync) {
        ESP_RETURN_ON_FALSE(esp_ptr_in_iram(callbacks->on_vsync), ESP_ERR_INVALID_ARG, TAG, "on_vsync callback not in IRAM");
    }
    if (user_ctx) {
        ESP_RETURN_ON_FALSE(esp_ptr_internal(user_ctx), ESP_ERR_INVALID_ARG, TAG, "user context not in internal RAM");
    }
#endif // CONFIG_LCD_DSI_ISR_IRAM_SAFE
    dsi_panel->on_vsync = callbacks->on_vsync;
    dsi_panel->user_ctx = user_ctx;
    return ESP_OK;
}

esp_err_t esp_lcd_dsi_panel_get_frame_buffer(esp_lcd_panel_handle_t panel, uint32_t fb_num, void **fb0, ...)
{
    ESP_RETURN_ON_FALSE(panel, ESP_ERR_INVALID_ARG, TAG, "invalid argument");
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    ESP_RETURN_ON_FALSE(fb_num && fb_num <= dsi_panel->num_fbs, ESP_ERR_INVALID_ARG, TAG, "invalid frame buffer number");
    void **fb_itor = fb0;
    va_list args;
    va_start(args, fb0);
    for (int i = 0; i < fb_num; i++) {
        if (fb_itor) {
            *fb_itor = dsi_panel->fbs[i];
            fb_itor = va_arg(args, void **);
        }
    }
    va_end(args);
    return ESP_OK;
}

static esp_err_t dsi_panel_del(esp_lcd_panel_t *panel)
{
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    ESP_LOGI(TAG, "del dsi panel @%p", panel);
    ESP_RETURN_ON_ERROR(lcd_dsi_panel_destory(dsi_panel), TAG, "destroy dsi panel @%p failed", panel);
    return ESP_OK;
}

static esp_err_t dsi_panel_reset(esp_lcd_panel_t *panel)
{
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    return ESP_OK;
}

static esp_err_t dsi_panel_init(esp_lcd_panel_t *panel)
{
    esp_err_t ret = ESP_OK;
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);

#if !TEST_DSI_LOOPBACK && TEST_DSI_ESCAPE_MODE
    // 可以断开 clk lane, 观察data lane0 是否进入了escape mode
    uint16_t data[128];

    ESP_LOGI(TAG, "esacpe mode test");

    for (int x = 0; x < 128; x++) {
        data[x] = 0x001F;
    }

    for (int x = 0; x < 100; x++) {
        // Memory write
        mipi_dcs_write_data((uint8_t *)data, 128 * 2);
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    mipi_dcs_write_cmd(0x29, 0); //Display ON
#endif

    // MIPI_DSI_HOST.phy_ulps_ctrl.phy_txexitulpsclk = 1;
    mipi_dsih_hal_gen_cmd_mode_en(0);

    MIPI_DSI_HOST.lpclk_ctrl.val = 0x00000000 |
                                   ((1 & 0x00000001) << 1) | // bit[    1] AUTO_CLKLANE_CTRL     = 0 (Automatic mechanism to stop providing clock in the clock lane when time allows.
                                   ((1 & 0x00000001) << 0);  // bit[    0] TXREQUESTCLKHS        = 1 (Requesting High Speed Clock Transmission.
#if TEST_DSI_PATTERN
    MIPI_DSI_HOST.vid_mode_cfg.val = 0x00000000 |
                                     ((1 & 0x00000001) << 24) | // bit[   24] VPG_ORIENTATION       = 1 (Video Pattern Generator Orientation - 0=Vertical / 1=Horizontal
                                     ((0 & 0x00000001) << 20) | // bit[   20] VPG_MODE              = 0 (Video Pattern Generator Mode        - 0=ColorBAr / 1=BER Testing
                                     ((1 & 0x00000001) << 16) | // bit[   16] VPG_EN                = 0 (Video Pattern Generator Activation
                                     ((0 & 0x00000001) << 15) | // bit[   15] LPCMDEN               = 0 (Enables Low Power command transmission.
                                     ((1 & 0x00000001) << 13) | // bit[   13] LP_HFP_EN             = 1 (Enables Low Power HFP.
                                     ((1 & 0x00000001) << 12) | // bit[   12] LP_HBP_EN             = 1 (Enables Low Power HBP.
                                     ((1 & 0x00000001) << 11) | // bit[   11] LP_VACT_EN            = 1 (Enables Low Power VACT.
                                     ((1 & 0x00000001) << 10) | // bit[   10] LP_VFP_EN             = 1 (Enables Low Power VFP.
                                     ((1 & 0x00000001) << 9) |  // bit[    9] LP_VBP_EN             = 1 (Enables Low Power VBP.
                                     ((1 & 0x00000001) << 8) |  // bit[    8] LP_VSA_EN             = 1 (Enables Low Power VSA.
                                     ((2 & 0x00000003) << 0);   // bit[ 1: 0] VIDEO_MODE            = 2 (Video transmission mode. - 2=Burst Mode
    while (1) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }
#endif

    dw_gdma_mipi_dsi_register_callback(lcd_default_isr_handler, dsi_panel);

    // Enable DW_GDMA CH-2 transfer.
    dw_gdma_mipi_dsi_start();

    esp_rom_delay_us(10);

