Lzw655/esp-bsp/examples/p4/base_demo_anti_tearing/esp32_p4_function_ev_board/src/lcd/esp_lcd_panel_dsi.c
static esp_err_t dsi_panel_draw_bitmap(esp_lcd_panel_t *panel, int x_start, int y_start, int x_end, int y_end, const void *color_data)
{
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    ESP_RETURN_ON_FALSE(dsi_panel->num_fbs > 0, ESP_ERR_NOT_SUPPORTED, TAG, "no frame buffer installed");
    assert((x_start < x_end) && (y_start < y_end) && "start position must be smaller than end position");

    // check if we need to copy the draw buffer (pointed by the color_data) to the driver's frame buffer
    bool do_copy = false;
    if (color_data == dsi_panel->fbs[0]) {
        dsi_panel->cur_fb_index = 0;
    } else if (color_data == dsi_panel->fbs[1]) {
        dsi_panel->cur_fb_index = 1;
    } else if (color_data == dsi_panel->fbs[2]) {
        dsi_panel->cur_fb_index = 2;
    } else {
        // we do the copy only if the color_data is different from either frame buffer
        do_copy = true;
    }

    // adjust the flush window by adding extra gap
    x_start += dsi_panel->x_gap;
    y_start += dsi_panel->y_gap;
    x_end += dsi_panel->x_gap;
    y_end += dsi_panel->y_gap;
    // round the boundary
    int h_res = dsi_panel->timings.h_res;
    int v_res = dsi_panel->timings.v_res;
    if (dsi_panel->rotate_mask & ROTATE_MASK_SWAP_XY) {
        x_start = MIN(x_start, v_res);
        x_end = MIN(x_end, v_res);
        y_start = MIN(y_start, h_res);
        y_end = MIN(y_end, h_res);
    } else {
        x_start = MIN(x_start, h_res);
        x_end = MIN(x_end, h_res);
        y_start = MIN(y_start, v_res);
        y_end = MIN(y_end, v_res);
    }

    int bytes_per_pixel = dsi_panel->fb_bits_per_pixel / 8;
    int pixels_per_line = dsi_panel->timings.h_res;
    uint32_t bytes_per_line = bytes_per_pixel * pixels_per_line;
    uint8_t *fb = dsi_panel->fbs[dsi_panel->cur_fb_index];
    size_t bytes_to_flush = v_res * h_res * bytes_per_pixel;
    uint8_t *flush_ptr = fb;

    if (do_copy) {
        // copy the UI draw buffer into internal frame buffer
        const uint8_t *from = (const uint8_t *)color_data;
        uint32_t copy_bytes_per_line = (x_end - x_start) * bytes_per_pixel;
        size_t offset = y_start * copy_bytes_per_line + x_start * bytes_per_pixel;
        uint8_t *to = fb;
        if (1 == bytes_per_pixel) {
            COPY_PIXEL_CODE_BLOCK(8)
        } else if (2 == bytes_per_pixel) {
            COPY_PIXEL_CODE_BLOCK(16)
        } else if (3 == bytes_per_pixel) {
            COPY_PIXEL_CODE_BLOCK(24)
        }
    } else {
        dw_gdma_mipi_dsi_set_buffer(color_data);
    }

    if (dsi_panel->flags.fb_in_psram) {
        // CPU writes data to PSRAM through DCache, data in PSRAM might not get updated, so write back
        ESP_RETURN_ON_ERROR(esp_cache_msync(flush_ptr, bytes_to_flush, 0), TAG, "flush cache buffer failed");

        // Cache_WriteBack_Addr(CACHE_MAP_L1_DCACHE, color_data, bytes_to_flush);
        // Cache_WriteBack_Addr(CACHE_MAP_L2_CACHE, color_data, bytes_to_flush);
    }

    return ESP_OK;
}

static esp_err_t dsi_panel_invert_color(esp_lcd_panel_t *panel, bool invert_color_data)
{
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    return ESP_OK;
}

static esp_err_t dsi_panel_mirror(esp_lcd_panel_t *panel, bool mirror_x, bool mirror_y)
{
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    dsi_panel->rotate_mask &= ~(ROTATE_MASK_MIRROR_X | ROTATE_MASK_MIRROR_Y);
    dsi_panel->rotate_mask |= (mirror_x << DSI_PANEL_MIRROR_X | mirror_y << DSI_PANEL_MIRROR_Y);
    return ESP_OK;
}

static esp_err_t dsi_panel_swap_xy(esp_lcd_panel_t *panel, bool swap_axes)
{
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    dsi_panel->rotate_mask &= ~(ROTATE_MASK_SWAP_XY);
    dsi_panel->rotate_mask |= swap_axes << DSI_PANEL_SWAP_XY;
    return ESP_OK;
}

static esp_err_t dsi_panel_set_gap(esp_lcd_panel_t *panel, int x_gap, int y_gap)
{
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    dsi_panel->x_gap = x_gap;
    dsi_panel->y_gap = y_gap;
    return ESP_OK;
}

static esp_err_t dsi_panel_disp_on_off(esp_lcd_panel_t *panel, bool on_off)
{
    esp_dsi_panel_t *dsi_panel = __containerof(panel, esp_dsi_panel_t, base);
    return ESP_OK;
}

static void test(void)
{
    ESP_DRAM_LOGE(TAG, "a");
}

IRAM_ATTR static void lcd_default_isr_handler(void *args)
{
    esp_dsi_panel_t *dsi_panel = (esp_dsi_panel_t *)args;
    bool need_yield = false;

    // call user registered callback
    if (dsi_panel->on_vsync) {
        if (dsi_panel->on_vsync(&dsi_panel->base, NULL, dsi_panel->user_ctx)) {
            need_yield = true;
        }
    }

    if (need_yield) {
        portYIELD_FROM_ISR();
    }
}
